local_rus = {
    "новая_игра": "Новая игра",
    "настройки": "Настройки",
    "выйти": "Выйти",
    "рыба": "Съешь ещё больше этих сладких французских булок.",
    "громкость": "Громкость: ",
    "сохранить_изменения": "Сохранить изменения",
    "вернуться": "Вернуться",
    "русский": "Русский",
    "китайский": "Китайский",
    "латинский": "Латинский",
    "пусто": "Пусто"
}

local_chi = {
    "новая_игра": "新游戏",
    "настройки": "设置",
    "выйти": "出去",
    "рыба": "多吃那些甜的法式面包。",
    "громкость": "体积：",
    "сохранить_изменения": "保存更改",
    "вернуться": "返回",
    "русский": "俄语",
    "китайский": "中国人",
    "латинский": "拉丁语",
    "пусто": "空的"
}

local_lat = {
    "новая_игра": "Novum ludum",
    "настройки": "Occasus",
    "выйти": "Exite",
    "рыба": "Plus comedunt ex illis dulcibus paunculis Gallicis.",
    "громкость": "Magnitudo:",
    "сохранить_изменения": "Servare Mutationes",
    "вернуться": "Redi",
    "русский": "Russica",
    "китайский": "Seres",
    "латинский": "Latinae",
    "пусто": "Inanis"
}

current_local = local_rus