local_rus = {
    "новая_игра": "Новая игра",
    "настройки": "Настройки",
    "выйти": "Выйти",
    "рыба": "Съешь ещё больше этих сладких французских булок.",
    "громкость": "Громкость: ",
    "сохранить_изменения": "Сохранить изменения",
    "вернуться": "Вернуться",
    "русский": "Русский",
    "китайский": "Китайский",
    "латинский": "Латинский",
    "пусто": "Пусто",
    "якуб_мотив_1": "Нажимай уже на кнопку!",
    "якуб_мотив_2": "Ну чего ты ждешь?",
    "якуб_мотив_3": "Особое приглашение нужно?",
    "якуб_мотив_4": "Часики-то тикают.."
}

local_chi = {
    "новая_игра": "新游戏",
    "настройки": "设置",
    "выйти": "出去",
    "рыба": "多吃那些甜的法式面包。",
    "громкость": "体积：",
    "сохранить_изменения": "保存更改",
    "вернуться": "返回",
    "русский": "俄语",
    "китайский": "中国人",
    "латинский": "拉丁语",
    "пусто": "空的",
    "якуб_мотив_1": "已经按下按钮了！",
    "якуб_мотив_2": "那么，你还等什么呢？",
    "якуб_мотив_3": "需要特别邀请吗？",
    "якуб_мотив_4": "时钟在滴答作响。。"
}

local_lat = {
    "новая_игра": "Novum ludum",
    "настройки": "Occasus",
    "выйти": "Exite",
    "рыба": "Plus comedunt ex illis dulcibus paunculis Gallicis.",
    "громкость": "Magnitudo:",
    "сохранить_изменения": "Servare Mutationes",
    "вернуться": "Redi",
    "русский": "Russica",
    "китайский": "Seres",
    "латинский": "Latinae",
    "пусто": "Inanis",
    "якуб_мотив_1": "Preme ipsum iam!",
    "якуб_мотив_2": "Hem, quid moraris?",
    "якуб_мотив_3": "Egesne invitationem specialem?",
    "якуб_мотив_4": "Horologium utilatate.."
}

current_local = local_rus
screen_width = 800
screen_height = 600

helper_motivational_phrases = (
    "якуб_мотив_1",
    "якуб_мотив_2",
    "якуб_мотив_3",
    "якуб_мотив_4"
)
helper_blink_freq = 4000
helper_motivational_phrase_freq = 10000